vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXE247_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXE247</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXE247" Dvendor="NXP:11">
      <description>MCXE247</description>
      <device Dname="MCXE247">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="0"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXE247/iar/MCXE247_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x080000" access="rx" default="1"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x1000" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x180000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1ffe0000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x01f000" access="rw" default="1"/>
        <algorithm name="devices/MCXE247/arm/MCXE247_P1536_4KB_SEC.FLM" start="0x00000000" size="0x00180000" RAMstart="0x1ffe0000" RAMsize="0x0003f000" default="1"/>
        <debug svd="devices/MCXE247/MCXE247.xml"/>
        <variant Dvariant="MCXE247VLL">
          <compile header="devices/MCXE247/fsl_device_registers.h" define="CPU_MCXE247VLL"/>
        </variant>
        <variant Dvariant="MCXE247VLQ">
          <compile header="devices/MCXE247/fsl_device_registers.h" define="CPU_MCXE247VLQ"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXE247.internal_condition">
      <accept Dname="MCXE247VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXE247VLQ" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXE247.internal_condition">
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_lpspi.condition_id">
      <require condition="allOf.driver.lpspi, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=driver.port, driver.gpio, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.port, driver.gpio, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.port.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=MCXE247.internal_condition"/>
    </condition>
