vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="device_id.MCXE247.internal_condition">
      <accept Dname="MCXE247VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXE247VLQ" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=driver.sim, device_id=MCXE247, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=driver.sim, device_id=MCXE247, driver.common.internal_condition">
      <require condition="anyOf.allOf=driver.sim, device_id=MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=driver.sim, device_id=MCXE247.internal_condition">
      <accept condition="allOf.driver.sim, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sim, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sim"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1170.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1180.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxe31x.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxn.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_rw610.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_scfw.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXE247.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device_id=MCXE247, driver.dmamux, driver.edma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE247, driver.dmamux, driver.edma.internal_condition">
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE247.internal_condition">
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXE247.internal_condition">
      <accept Dname="MCXE247VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXE247VLQ" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MCXE247.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MCXE247.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MCXE247.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MCXE247.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MCXE247.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MCXE247.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=MCXE247, device.startup, driver.adc12, driver.clock, driver.common, driver.gpio, driver.lpi2c, driver.lpuart, driver.port, driver.smc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=MCXE247, device.startup, driver.adc12, driver.clock, driver.common, driver.gpio, driver.lpi2c, driver.lpuart, driver.port, driver.smc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
