vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE247_system"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE247_header"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.adc12.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.cache_lmem.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_enet.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.Ethernet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, component.eth_phy_common, device.RTE, driver.enet, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.Ethernet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, component.eth_phy_common, device.RTE, driver.enet, device_id=MCXE247.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.2.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.2.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_gpio.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXE247.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="GPIO" Capiversion="1.0.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MCXE247.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MCXE247.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
