vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE247, device.RTE, device_id=MCXE247, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MCXE247.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm4f.condition_id">
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="cores.cm4f.internal_condition">
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.driver.common, driver.dmamux, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dmamux, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.ela_csec.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.enet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247, driver.flexcan_soc.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXE247, driver.flexcan_soc.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan_soc"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexcan, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexcan, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.flexcan_soc.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_spi, driver.edma, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_spi, driver.edma, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_uart, driver.edma, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_uart, driver.edma, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.ftm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
