vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpi2c, driver.edma, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpi2c, driver.edma, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpit.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpspi, driver.edma, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpspi, driver.edma, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpuart, driver.edma, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpuart, driver.edma, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.mcm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.pdb.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.qspi.condition_id">
      <require condition="allOf.anyOf=allOf=device_id=MCXE247, driver.qspi_mcxe247, driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=device_id=MCXE247, driver.qspi_mcxe247, driver.common, device_id=MCXE247.internal_condition">
      <require condition="anyOf.allOf=device_id=MCXE247, driver.qspi_mcxe247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE247.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=device_id=MCXE247, driver.qspi_mcxe247.internal_condition">
      <accept condition="allOf.device_id=MCXE247, driver.qspi_mcxe247.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE247, driver.qspi_mcxe247.internal_condition">
      <require condition="device_id.MCXE247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_mcxe247"/>
    </condition>
    <condition id="driver.qspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.qspi, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.qspi, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="qspi"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.qspi_mcxe247.condition_id">
      <require condition="allOf.device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
