vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.sysmpu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.trgmux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="driver.wdog32.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE247.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk, cores=cm4f.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.driver.common, utility.debug_console, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="not.utility.assert.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="not.utility.assert.internal_condition">
      <deny Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, utility.str, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, utility.str, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, driver.common, not=utility.debug_console, utility.str, component.lpuart_adapter, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, driver.common, not=utility.debug_console, utility.str, component.lpuart_adapter, device=MCXE247.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="not.utility.debug_console.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="not.utility.debug_console.internal_condition">
      <deny Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="utility.debug_console_template_config.condition_id">
      <require condition="allOf.utility.debug_console, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="utility.incbin.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.device=MCXE247.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MCXE247.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MCXE247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXE247.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=MCXE247.internal_condition"/>
    </condition>
