vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE247_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_edma" Cversion="2.2.4" condition="driver.qspi_edma.condition_id">
      <description>QSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_qspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_qspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_mcxe247" Cversion="2.0.0" condition="driver.qspi_mcxe247.condition_id">
      <description>QSPI mcxe247 Soc Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_qspi_soc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE247/drivers/fsl_qspi_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rcm" Cversion="2.0.4" condition="driver.rcm.condition_id">
      <description>RCM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_rcm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE247/drivers/fsl_rcm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.4.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE247/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.2.0" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smc" Cversion="2.0.7" condition="driver.smc.condition_id">
      <description>SMC Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_smc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_smc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sysmpu" Cversion="2.2.3" condition="driver.sysmpu.condition_id">
      <description>SYSMPU Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_sysmpu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_sysmpu.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trgmux" Cversion="2.0.1" condition="driver.trgmux.condition_id">
      <description>TRGMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_trgmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_trgmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wdog" Cversion="2.2.1" condition="driver.wdog32.condition_id">
      <description>WDOG32 Driver</description>
      <files>
        <file category="header" name="devices/MCXE247/drivers/fsl_wdog32.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE247/drivers/fsl_wdog32.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXE247/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXE247/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, mdk, cores=cm4f.condition_id" category="sourceAsm" name="devices/MCXE247/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/debug_console/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE247/utilities/debug_console/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE247/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE247/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE247/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/debug_console/fsl_debug_console.h" projectpath="utilities/debug_console"/>
        <file category="sourceC" name="devices/MCXE247/utilities/debug_console/fsl_debug_console.c" projectpath="utilities/debug_console"/>
        <file category="include" name="devices/MCXE247/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/MCXE247/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/MCXE247/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config" Cversion="1.0.0" condition="utility.debug_console_template_config.condition_id">
      <description>Utility debug_console Template Config</description>
      <files>
        <file category="header" attr="config" name="devices/MCXE247/utilities/debug_console/config/fsl_debug_console_conf.h" version="1.0.0" projectpath="utilities/debug_console/config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/MCXE247/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/MCXE247/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/MCXE247/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/MCXE247/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE247/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE247/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/MCXE247/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/MCXE247/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/MCXE247/utilities/str/"/>
      </files>
    </component>
  </components>
</package>